import * as React from 'react';
import {FastCommentsCommentWidget} from 'fastcomments-react'

export const Appointment = () => {

    return (
        <>
       <h4> Appointment </h4>
       
       </>
    )
}

/*
Евгений, доброго дня! 
Хочу поднять важный вопрос. 
Надо повысить мою продуктивность выраженную в денежном эквиваленте) 
Как можно доиндексировать зарплату до того славного эквивалента, когда я устраивался на работу и курс был 66 а потом и выше расти?
Я планировал досеньориться до 3000$ в краткосрочной перспективе, но пока что все идет в обратную сторону.
Вопрос сопровождается предложениями). 

У нас сейчас идет обсуждение медицинского кабинета, давайте увеличим мое участие в этом процессе.
Я бы мог учавствовать в прототипировании этого портала, потом заниматься дизайном, 
я числился арт-директором несколько лет в одном из мест работы и этот навык бесследно не должен был исчезнуть.
Можно все планировать/рисовать в фигме, но у меня есть ИННОВАЦИОННАЯ идея)
Пользуясь библиотекой готовых компонентов (она еще шире, чем MUI) https://mantine.dev/ совместить процессы обсуждения/прототипирования/дизайна.
Это будет удобный и наглядный подход, который позволит ислючить повторения работы, упростить цепь 
"обсуждение - докфайл который гуляет по почтам, - ТЗ дизайнеру - диизайнер с фигмой - ТЗ фронту - сам фронтэнд"

Я накидал образец такой схемы https://mantine-start.vercel.app/
Идея такая - мы переносим все, что есть пока что в док файле в такой эскиз сайта 
(возможно, стоит перенести на наш хост и посомтреть еще альтернативы движку комментариев), где все уже будет разбито по будующим страницам, 
сначала содержимое каждого раздела прописываем просто списком, потом постепенно я визуализирую его мок-компонентами, дальше уже прописывать взаимодействие с вервером
А внизу под уже работающим интерфейсом секция комментов. 
При этом все могут комментировать что надо изменить, вести обсуждение и все это в одном месте.

Структура будет видна всем нагляднее, логика будет прорисовываться четче, общее позитвное ощущение от процесса, мне кажется, возрастет.
Это может касаться и любого другого старта

https://vc.ru/design/181226-poisk-dlya-internet-magazina-24-obyazatelnyh-elementa-kotorye-pomogut-pokupatelyam-nayti-nuzhnoe-i-uvelichat-konversiyu
https://quantumart.ru/products/qp8-search
https://quantumart.ru/products/qp8-search

ру
https://multisearch.io/pricing
https://searchbooster.io/ru/
https://1ps.ru/blog/dirs/2021/umnyij-poisk-na-sajte-preimushhestva-vozmozhnosti-i-sposobyi-nastrojki/
https://promosearch.ru/
https://kealabs.ru/


https://cusdis.com/doc#/
*/